// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
//1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
//6, 1, 33 -> [6, 1, 33]



int[] array = new int[8];
Random MyRandom = new Random();

for (int i = 0; i < 8; i++)
{
    array[i] = MyRandom.Next(1, 100); //поставила ограничение до 100 для случайных чисел массива
}

for (int i = 0; i < 8; i++)
{
    Console.Write(array[i] + " ");
}
